{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "s1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "s1_input"}, "inbound_nodes": []}, {"name": "s2_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "s2_input"}, "inbound_nodes": []}, {"name": "primary_embedding", "class_name": "Embedding", "config": {"name": "primary_embedding", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 90237, "output_dim": 17, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["s1_input", 0, 0, {}]], [["s2_input", 0, 0, {}]]]}, {"name": "dot_product", "class_name": "Dot", "config": {"name": "dot_product", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["primary_embedding", 0, 0, {}], ["primary_embedding", 1, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["dot_product", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "input_layers": [["s1_input", 0, 0], ["s2_input", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}